money_capital = 20000  # Подушка безопасности
salary = 5000  # Ежемесячная зарплата
spend = 6000  # Траты за первый месяц
increase = 0.05  # Ежемесячный рост цен

# TODO Посчитайте количество  месяцев, которое можно протянуть без долгов
months = 0
budget = money_capital + salary
while budget >= spend:
    months += 1 #Увеличиваем количество месяцев
    budget -= spend #вычитаем из бюджета траты за месяц
    spend *= (1 + increase) #находим увеличение затрат в следующий месяц из-за роста цен
    budget += salary #добавляем к текущему бюджету зарплату за следующий месяц

print(f"Количество месяцев, которое можно протянуть без долгов:", months)
